source/_posts2/tg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-Hans" xml:lang="zh-Hans">
<head>
<!-- 2016-12-15 Thu 01:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>test2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jimmy m Gong" />
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap-theme.min.css" integrity="sha384-rHyoN1iRsVXV4nD0JutlnGaslCJuC7uwjduW9SVrLvRYooPp2bWYgmgJQIXwl/Sp" crossorigin="anonymous">
</head>
<body>
<div id="content">
<h1 class="title">test2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0b2fdf">org-mode structure</a>
<ul>
<li><a href="#org183023e">A subheading</a></li>
<li><a href="#org63bcb05">navigation</a></li>
<li><a href="#orgf0f5000">lists</a>
<ul>
<li><a href="#org2d18fd7">bullet lists</a></li>
<li><a href="#org0be11a2">numbered lists</a></li>
<li><a href="#org483774c">checklists <code>[/]</code></a></li>
<li><a href="#org1c687c4">definition lists</a></li>
<li><a href="#orgfc57556">Test me</a></li>
</ul>
</li>
<li><a href="#org09de56d">Lord of the Rings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="orgc0b2fdf" class="outline-2">
<h2 id="orgc0b2fdf">org-mode structure</h2>
<div class="outline-text-2" id="text-orgc0b2fdf">
<p>
Text in org is structured by headings, denoted by lines starting with
one or more * so we are currently in a section!
</p>
</div>

<div id="org183023e" class="outline-3">
<h3 id="org183023e">A subheading</h3>
<div class="outline-text-3" id="text-org183023e">
<p>
Starts with an extra * and so on
</p>
</div>
</div>

<div id="org63bcb05" class="outline-3">
<h3 id="org63bcb05">navigation</h3>
<div class="outline-text-3" id="text-org63bcb05">
<p>
Headings can be expanded or collapsed by moving to the (sub)heading
and pressing TAB. S-TAB cycles all headings. You can jump to next and
previous headings with C-c C-n and C-c C-p respectively.
</p>

<p>
You can move headings up and down to reorder them with the arrow keys,
using M-up or M-down. You can change the level of headings with M-left
and M-right (and use M-S-left and M-S-right to also change the levels
of and subheadings).
</p>
</div>
</div>

<div id="orgf0f5000" class="outline-3">
<h3 id="orgf0f5000">lists</h3>
<div class="outline-text-3" id="text-orgf0f5000">
</div><div id="org2d18fd7" class="outline-4">
<h4 id="org2d18fd7">bullet lists</h4>
<div class="outline-text-4" id="text-org2d18fd7">
<ul class="org-ul">
<li>bullet lists can be created like this (start a line with one or
more space and a -</li>
<li>pressing M-RET gives you a new bullet</li>
<li>we might also like nested bullets
<ul class="org-ul">
<li>like this one (I pressed M-RET TAB to indent it)</li>
<li>and another (M-RET now indents to the new level)</li>
</ul></li>
<li>the nice thing is that for long lines of text, emacs wraps them
so that they line up with the bullet</li>
<li>you can also reorder list items and change indentation using
M-up or M-down just like with section headings</li>
<li>you can change bullet style using S-left and S-right</li>
</ul>
</div>
</div>

<div id="org0be11a2" class="outline-4">
<h4 id="org0be11a2">numbered lists</h4>
<div class="outline-text-4" id="text-org0be11a2">
<ol class="org-ol">
<li>numbered lists are also possible</li>
<li>M-RET gives me a new number</li>
</ol>
</div>
</div>

<div id="org483774c" class="outline-4">
<h4 id="org483774c">checklists <code>[/]</code></h4>
<div class="outline-text-4" id="text-org483774c">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> we can even have check lists</li>
<li class="off"><code>[&#xa0;]</code> M-S-RET gives a new item with a check box</li>
<li class="off"><code>[&#xa0;]</code> C-c C-c check/unchecks a box</li>
<li class="off"><code>[&#xa0;]</code> you can have sub items
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> like this</li>
<li class="off"><code>[&#xa0;]</code> that can be checked off individually</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> and you can track the number of items by adding <code>[/]</code> to the end
of a line above a checklist - this updates when you check items off</li>
</ul>
</div>
</div>

<div id="org1c687c4" class="outline-4">
<h4 id="org1c687c4">definition lists</h4>
<div class="outline-text-4" id="text-org1c687c4">
<dl class="org-dl">
<dt>definition lists</dt><dd>these are useful sometimes</dd>
<dt>item 2</dt><dd>M-RET again gives another item, and long lines wrap in a
tidy way underneath the definition</dd>
</dl>
</div>
</div>

<div id="orgfc57556" class="outline-4">
<h4 id="orgfc57556">Test me</h4>
<div class="outline-text-4" id="text-orgfc57556">
<p>
write something here :: xxxxxxxxxx
h999write something here 222 <br  />
3334write something here :: xxxxxxxxxx
write something here 111222
</p>

<p>
your are right
</p>
</div>
</div>
</div>

<div id="org09de56d" class="outline-3">
<h3 id="org09de56d">Lord of the Rings</h3>
<div class="outline-text-3" id="text-org09de56d">
<p>
My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim</li>
<li>Eowyn's fight with the witch king
<ul class="org-ul">
<li>this was already my favorite scene in the book</li>
<li>I really like Miranda Otto.</li>
</ul></li>
<li><p>
Peter Jackson being shot by Legolas
</p>
<ul class="org-ul">
<li>on DVD only</li>
</ul>
<p>
He makes a really funny face when it happens.
</p></li>
</ol>
<p>
But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
</p>
<dl class="org-dl">
<dt>Elijah Wood</dt><dd>He plays Frodo</dd>
<dt>Sean Austin</dt><dd>He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.</dd>
</dl>
</div>
</div>
</div>
</div>
</body>
</html>
